validation/REDIM-MAD-3D/coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       143280;
    }
    edge
    {
        type            patch;
        nFaces          600;
        startFace       143400;
    }
    inlet3
    {
        type            patch;
        nFaces          10;
        startFace       144000;
    }
    inlet2
    {
        type            patch;
        nFaces          10;
        startFace       144010;
    }
    inlet1
    {
        type            patch;
        nFaces          100;
        startFace       144020;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       144120;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          144000;
        startFace       144720;
    }
)

// ************************************************************************* //
