validation/REDIM-MAD-3D/coarse/constant/tableProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      tableProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationType3D	linearInterpolation3D;

interpolationType2D	linearInterpolation2D;

searchMethod	uniform;

gridResolution coarse;

iterativeTolerance      1e-3;

Zst 0.10054;

theta1Max  60;
theta1Min  1;

theta2Max  60;
theta2Min  1;

theta3Max  5;
theta3Min  1;

BoundaryBase	"enthalpy";

fp 0;

PVMax 1.898265891;

theta1_param
60
(
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
);

theta2_param
60
(
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
);

theta3_param
5
( 
1
2
3
4
5
);

PVnorm_param
101
(
0
0.01
0.02
0.03
0.04
0.05
0.06
0.07
0.08
0.09
0.1
0.11
0.12
0.13
0.14
0.15
0.16
0.17
0.18
0.19
0.2
0.21
0.22
0.23
0.24
0.25
0.26
0.27
0.28
0.29
0.3
0.31
0.32
0.33
0.34
0.35
0.36
0.37
0.38
0.39
0.4
0.41
0.42
0.43
0.44
0.45
0.46
0.47
0.48
0.49
0.5
0.51
0.52
0.53
0.54
0.55
0.56
0.57
0.58
0.59
0.6
0.61
0.62
0.63
0.64
0.65
0.66
0.67
0.68
0.69
0.7
0.71
0.72
0.73
0.74
0.75
0.76
0.77
0.78
0.79
0.8
0.81
0.82
0.83
0.84
0.85
0.86
0.87
0.88
0.89
0.9
0.91
0.92
0.93
0.94
0.95
0.96
0.97
0.98
0.99
1
);

Znorm_param
5
(
0
0.24
0.5
0.74
1
);

thetaMax
3
(
60
60
5
)
;

thetaMin
3
(
1
1
1
)
;


species
20
(
N2                       
H2                       
H                        
O2                       
O                        
H2O                      
OH                       
H2O2                     
HO2                      
CO                       
CO2                      
CH4                      
CH3                      
CH2(S)                   
CH3O                     
CH2O                     
HCO                      
C2H6                     
CH3OCH3                  
CH3OCH2
);

fractionBasis mole;

fuel
{
    CH3OCH3 1.0;
}
oxidizer
{
    O2 0.21;
    N2 0.79;
}

CHEMKINFile "$FOAM_CASE/chemkin/chem.inp";
CHEMKINThermoFile "$FOAM_CASE/chemkin/therm.dat";
CHEMKINTransportFile "$FOAM_CASE/chemkin/transportProperties";
// ************************************************************************* //
